using Tyuiu.ZalyaletdinovDE.Sprint1.Task0.V4.Lib;

//ЗАДАНИЕ
//Написать программу, которая вычисляет выражение 10 / (2 + 3) и печатает результат на экране.

namespace Tyuiu.ZalyaletdinovDE.Sprint1.Task0.V4
{
    class Program
    {
        static void Main(string[] args)
        {
            DataService ds = new DataService();

            Console.Title = "Спринт #1 | Выполнил: Спирин И. С. | ПКТб-23-1";
            //Длинна строки 75 символов
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* Спринт #1                                                                                *");
            Console.WriteLine("* Тема: Базовые навыки работы в C#                                                         *");
            Console.WriteLine("* Задание #0                                                                               *");
            Console.WriteLine("* Вариант #0                                                                               *");
            Console.WriteLine("* Выполнил: Спирин Игорь Сергеевич | ПКТб-23-1                                             *");
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* УСЛОВИЕ:                                                                                 *");
            Console.WriteLine("* Написать программу, которая вычисляет выражение 4 / 2 * 5 / (3 + 2) * (5 - 2)            *");
            Console.WriteLine("* и печатает результат на экране.                                                          *");
            Console.WriteLine("*                                                                                          *");
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                                         *");
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* 4 / 2 * 5 / (3 + 2) * (5 - 2)                                                            *");
            Console.WriteLine("********************************************************************************************");
            Console.WriteLine("* РЕЗУЛЬТАТ:                                                                               *");
            Console.WriteLine("********************************************************************************************");

            Console.WriteLine(ds.Calculate());

        }
    }
}